Autodesk.Revit.Exceptions.BackgroundTaskCancelledException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.BackgroundTaskCancelledException
The exception thrown when Revit cancels a background operation. Third-party
developers are not expected to catch and handle this exception. Instead, if allowed
to propagate back to Revit code, it will be handled by Revit.
Since: 2017